Autodesk.Revit.UI.IModelessUI.AccessGranted
Modeless UI component is notified that it can access Revit document.
This is called in return to the "RequestAccess" that the UI component has to call on the ModelessUIManager
Since:
2017

Autodesk.Revit.UI.IModelessUI.SelectionChanged
Modeless UI component is notified that current selection has changed
Remarks:
There are some restriction when this notificatios appears:
the client is not allowed to change the current selection, switch to a different document, switch to another view
Since:
2017

Autodesk.Revit.UI.IModelessUI
Interface for modeless UI components. Add-ins which displays modeless UI components should implement this interface
in order to be notified when selection is changed or when the component has access to make changes in the Revit model.
Remarks:
It's exposed in internal API.
Since:
2017